Revit 2027 API
AreaLoad.NumRefPoints Property
 Returns the total number of reference points for the area load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumRefPoints { get; }
Public ReadOnly Property NumRefPoints As Integer
	Get
public:
property int NumRefPoints {
	int get ();
}
member NumRefPoints : int with get
Property Value
Int32
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace